In [4]:
import numpy as np
import pandas as pd
import seaborn as sns

In [4]:
# data={'Name':['Ananya','Ark','Manjula','Tarun'],'Age':[20,15,46,49],'Rating':[43,56,72,31]}
# print('Data is\n',data)
# df=pd.DataFrame(data)
# print('DataFrame is \n',df)

Data is
 {'Name': ['Ananya', 'Ark', 'Manjula', 'Tarun'], 'Age': [20, 15, 46, 49], 'Rating': [43, 56, 72, 31]}
DataFrame is
       Name  Age  Rating
0   Ananya   20      43
1      Ark   15      56
2  Manjula   46      72
3    Tarun   49      31

In [5]:
# df.columns

Index(['Name', 'Age', 'Rating'], dtype='object')

In [6]:
#df.rows doesn't exist
# df.T

             0    1        2      3
Name    Ananya  Ark  Manjula  Tarun
Age         20   15       46     49
Rating      43   56       72     31

In [7]:
# df.dtypes

Name      object
Age        int64
Rating     int64
dtype: object

In [8]:
# print(df)
# df.shape

      Name  Age  Rating
0   Ananya   20      43
1      Ark   15      56
2  Manjula   46      72
3    Tarun   49      31

(4, 3)

In [9]:
# df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Rating  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [10]:
# df.values

array([['Ananya', 20, 43],
       ['Ark', 15, 56],
       ['Manjula', 46, 72],
       ['Tarun', 49, 31]], dtype=object)

In [11]:
# df.head()
#returns first 5 rows by default

      Name  Age  Rating
0   Ananya   20      43
1      Ark   15      56
2  Manjula   46      72
3    Tarun   49      31

In [12]:
# df.tail(4)

      Name  Age  Rating
0   Ananya   20      43
1      Ark   15      56
2  Manjula   46      72
3    Tarun   49      31

In [13]:
df.sum()

Name      AnanyaArkManjulaTarun
Age                         130
Rating                      202
dtype: object

In [14]:
df.sum(1)

0     63
1     71
2    118
3     80
dtype: int64

In [15]:
df.mean()

Age       32.5
Rating    50.5
dtype: float64

In [16]:
df.std()

Age       17.483325
Rating    17.597348
dtype: float64

In [17]:
df.describe()

             Age     Rating
count   4.000000   4.000000
mean   32.500000  50.500000
std    17.483325  17.597348
min    15.000000  31.000000
25%    18.750000  40.000000
50%    33.000000  49.500000
75%    46.750000  60.000000
max    49.000000  72.000000

In [18]:
df.describe(include=['object'])

           Name
count         4
unique        4
top     Manjula
freq          1

In [19]:
df.describe(include='all')

           Name        Age     Rating
count         4   4.000000   4.000000
unique        4        NaN        NaN
top     Manjula        NaN        NaN
freq          1        NaN        NaN
mean        NaN  32.500000  50.500000
std         NaN  17.483325  17.597348
min         NaN  15.000000  31.000000
25%         NaN  18.750000  40.000000
50%         NaN  33.000000  49.500000
75%         NaN  46.750000  60.000000
max         NaN  49.000000  72.000000

In [20]:
df=pd.read_csv('data/Iris.csv')
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [21]:
df.tail()

,Id,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
145,146,6.7,3.0,5.2,2.3,Iris-virginica
146,147,6.3,2.5,5.0,1.9,Iris-virginica
147,148,6.5,3.0,5.2,2.0,Iris-virginica
148,149,6.2,3.4,5.4,2.3,Iris-virginica
149,150,5.9,3.0,5.1,1.8,Iris-virginica

In [22]:
print(df.shape)

(150, 6)

In [23]:
print(df.columns)
print(df.mean())
print(df.std())

Index(['Id', 'SepalLengthCm', 'SepalWidthCm', 'PetalLengthCm', 'PetalWidthCm',
       'Species'],
      dtype='object')
Id               75.500000
SepalLengthCm     5.843333
SepalWidthCm      3.054000
PetalLengthCm     3.758667
PetalWidthCm      1.198667
dtype: float64
Id               43.445368
SepalLengthCm     0.828066
SepalWidthCm      0.433594
PetalLengthCm     1.764420
PetalWidthCm      0.763161
dtype: float64

In [24]:
df.describe()

               Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm
count  150.000000     150.000000    150.000000     150.000000    150.000000
mean    75.500000       5.843333      3.054000       3.758667      1.198667
std     43.445368       0.828066      0.433594       1.764420      0.763161
min      1.000000       4.300000      2.000000       1.000000      0.100000
25%     38.250000       5.100000      2.800000       1.600000      0.300000
50%     75.500000       5.800000      3.000000       4.350000      1.300000
75%    112.750000       6.400000      3.300000       5.100000      1.800000
max    150.000000       7.900000      4.400000       6.900000      2.500000

In [59]:
#df=pd.read_csv('data/nyc_weather.csv')

In [25]:
#df.head()

In [26]:
#df.info()

In [27]:
#print(df['Temperature'].head(10))

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             150 non-null    int64
 1   SepalLengthCm  150 non-null    float64
 2   SepalWidthCm   150 non-null    float64
 3   PetalLengthCm  150 non-null    float64
 4   PetalWidthCm   150 non-null    float64
 5   Species        150 non-null    object
dtypes: float64(4), int64(1), object(1)
memory usage: 7.2+ KB

In [34]:
#df['Species'].value_counts()
df.Species.value_counts()

Iris-virginica     50
Iris-versicolor    50
Iris-setosa        50
Name: Species, dtype: int64

In [39]:
df.apply(np.max)
#to check max value in each column
#applies the function on all columns
#alphabetically last

Id                          150
SepalLengthCm               7.9
SepalWidthCm                4.4
PetalLengthCm               6.9
PetalWidthCm                2.5
Species          Iris-virginica
dtype: object

In [38]:
df.apply(np.min)
#to check min value in each column
#applies the function on all columns
#alphabetically first

Id                         1
SepalLengthCm            4.3
SepalWidthCm               2
PetalLengthCm              1
PetalWidthCm             0.1
Species          Iris-setosa
dtype: object

In [40]:
df.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa